Repository: vivy-company/aizen
Catalog: aizen/Localizable.xcstrings
Source language: en
Languages: zh_hans

# agentSetup.autoDiscover.title
source: Auto Discover
zh_hans: 自动发现

# agentSetup.error.installFailed
source: Installation failed: %@
zh_hans: 安装失败：%@

# agentSetup.error.invalidExecutable
source: Selected file is not a valid executable
zh_hans: 所选文件不是有效的可执行文件

source: agentSetup.error.notFound.%@
zh_hans: 未找到代理 '%@'。请尝试安装或手动选择路径。

# agentSetup.error.notFound.claude
source: Agent 'claude' not found. Try installing or selecting a path manually.
zh_hans: 未找到代理 'claude'。请尝试安装或手动选择路径。

# agentSetup.error.notFound.codex
source: Agent 'codex' not found. Try installing or selecting a path manually.
zh_hans: 未找到代理 'codex'。请尝试安装或手动选择路径。

# agentSetup.error.notFound.gemini
source: Agent 'gemini' not found. Try installing or selecting a path manually.
zh_hans: 未找到代理 'gemini'。请尝试安装或手动选择路径。

# agentSetup.error.sessionFailed
source: Failed to start session: %@
zh_hans: 启动会话失败：%@

# agentSetup.install.description
source: Download and install the agent automatically
zh_hans: 自动下载并安装代理

# agentSetup.install.title
source: Install Agent
zh_hans: 安装代理

# agentSetup.installing
source: Installing Agent
zh_hans: 正在安装代理

# agentSetup.installingMessage.%@
source: Installing %@...
zh_hans: 正在安装 %@...

# agentSetup.installingMessage.claude
source: Installing Claude Code agent...
zh_hans: 正在安装 Claude Code 代理...

# agentSetup.installingMessage.codex
source: Installing Codex agent...
zh_hans: 正在安装 Codex 代理...

# agentSetup.installingMessage.gemini
source: Installing Gemini agent...
zh_hans: 正在安装 Gemini 代理...

# agentSetup.installingMessage.kimi
source: Installing Kimi agent...
zh_hans: 正在安装 Kimi 代理...

# agentSetup.installingMessage.opencode
source: Installing OpenCode agent...
zh_hans: 正在安装 OpenCode 代理...

# agentSetup.manualPath.description
source: Manually choose the agent executable location
zh_hans: 手动选择代理可执行文件位置

# agentSetup.manualPath.title
source: Select Executable Path
zh_hans: 选择可执行文件路径

source: agentSetup.message.%@
zh_hans: 代理 '%@' 未安装或未配置。

# agentSetup.message.claude
source: The 'claude' agent is not installed or configured.
zh_hans: 代理 'claude' 未安装或未配置。

# agentSetup.message.codex
source: The 'codex' agent is not installed or configured.
zh_hans: 代理 'codex' 未安装或未配置。

# agentSetup.message.gemini
source: The 'gemini' agent is not installed or configured.
zh_hans: 代理 'gemini' 未安装或未配置。

# agentSetup.openSettings
source: Open Settings
zh_hans: 打开设置

# agentSetup.retry
source: Retry Installation
zh_hans: 重试安装

# agentSetup.selectExecutable
source: Select the agent executable
zh_hans: 选择代理可执行文件

# agentSetup.title
source: Agent Not Configured
zh_hans: 代理未配置

# browser.control.back
source: Back
zh_hans: 返回

# browser.control.devtools
source: Toggle Developer Tools
zh_hans: 切换开发者工具

# browser.control.forward
source: Forward
zh_hans: 前进

# browser.control.reload
source: Reload
zh_hans: 重新加载

# browser.control.stop
source: Stop
zh_hans: 停止

# browser.control.url_placeholder
source: Enter URL or search
zh_hans: 输入 URL 或搜索

# browser.emptyState.newTab
source: New Browser Tab
zh_hans: 新建浏览器标签页

# browser.emptyState.subtitle
source: Open a new tab to start browsing
zh_hans: 打开新标签页开始浏览

# browser.emptyState.title
source: No Browser Tabs
zh_hans: 没有浏览器标签页

# browser.tab.new
source: New Tab
zh_hans: 新建标签页

# chat.agent.switch.message
source: Switching agents will clear the current conversation and start a new session. This cannot be undone.
zh_hans: 切换代理将清除当前对话并开始新会话。此操作无法撤销。

# chat.agent.switch.title
source: Switch Agent?
zh_hans: 切换代理？

# chat.agent.thinking
source: Agent is thinking...
zh_hans: 代理正在思考...

# chat.askAnything
source: Ask anything...
zh_hans: 随便问点什么...

# chat.attachment.file
source: File
zh_hans: 文件

# chat.attachment.generic
source: Attachment
zh_hans: 附件

# chat.attachment.terminalOutput
source: Terminal Output
zh_hans: 终端输出

# chat.authentication.authenticating
source: Authenticating...
zh_hans: 正在认证...

# chat.authentication.instructions
source: Follow the instructions below to authenticate
zh_hans: 按照以下说明进行身份验证

# chat.authentication.needed
source: Authentication needed to continue
zh_hans: 需要身份验证才能继续

# chat.authentication.notImplemented
source: ⚠️ This auth method is not implemented in claude-code-acp.
zh_hans: ⚠️ 此认证方法未在 claude-code-acp 中实现。

# chat.authentication.required
source: Authentication Required
zh_hans: 需要身份验证

# chat.authentication.skip
source: Skip Authentication
zh_hans: 跳过身份验证

# chat.authentication.skipInstructions
source: Then click 'Skip Authentication' below to start chatting.
zh_hans: 然后点击下方的「跳过身份验证」开始对话。

# chat.authentication.terminalInstructions
source: Instead, run this command in your terminal:
zh_hans: 请在终端中运行以下命令：

# chat.button.cancel
source: Cancel
zh_hans: 取消

# chat.button.switch
source: Switch
zh_hans: 切换

# chat.cancel
source: Cancel
zh_hans: 取消

# chat.code.copy
source: Copy code
zh_hans: 复制代码

# chat.content.audio
source: Audio
zh_hans: 音频

# chat.content.audioContent
source: [Audio content: %@]
zh_hans: [音频内容：%@]

# chat.content.audioType
source: Audio content: %@
zh_hans: 音频内容：%@

# chat.content.audioType %@
source: Audio: %@
zh_hans: 音频：%@

# chat.content.copied
source: Copied
zh_hans: 已复制

# chat.content.copy
source: Copy
zh_hans: 复制

# chat.content.diff
source: Diff
zh_hans: 差异

# chat.content.diffContent
source: Diff content
zh_hans: 差异内容

# chat.content.embedded
source: Embedded: %@
zh_hans: 嵌入：%@

# chat.content.embeddedResource
source: Embedded Resource
zh_hans: 嵌入资源

# chat.content.exitCode
source: Exit code: %lld
zh_hans: 退出码：%lld

# chat.content.file
source: File: %@
zh_hans: 文件：%@

# chat.content.image
source: Image
zh_hans: 图像

# chat.content.imageContent
source: [Image content]
zh_hans: [图像内容]

# chat.content.imageType
source: Image: %@
zh_hans: 图像：%@

# chat.content.imageType %@
source: Image: %@
zh_hans: 图像：%@

# chat.content.resource
source: Resource
zh_hans: 资源

# chat.content.resourceLink
source: Resource Link
zh_hans: 资源链接

# chat.content.resourceUri
source: Resource: %@
zh_hans: 资源：%@

# chat.content.resourceUri %@
source: Resource: %@
zh_hans: 资源：%@

# chat.content.terminal
source: Terminal
zh_hans: 终端

# chat.content.terminalCommand
source: Terminal: %@
zh_hans: 终端：%@

# chat.content.text
source: Text
zh_hans: 文本

# chat.content.textOutput
source: Text Output
zh_hans: 文本输出

# chat.copyMessage
source: Copy message
zh_hans: 复制消息

# chat.empty.subtitle
source: Start a conversation with an AI agent
zh_hans: 与 AI 代理开始对话

# chat.empty.title
source: No Chat Sessions
zh_hans: 没有对话会话

# chat.error.prefix
source: Error: %@
zh_hans: 错误：%@

# chat.error.prefix %@
source: Error: %@
zh_hans: 错误：%@

# chat.image.invalid
source: Invalid image data
zh_hans: 无效的图像数据

# chat.input.placeholder
source: Ask anything...
zh_hans: 随便问点什么...

# chat.message.copy
source: Copy message
zh_hans: 复制消息

# chat.model.select
source: Select model
zh_hans: 选择模型

# chat.noChatSessions
source: No Chat Sessions
zh_hans: 没有对话会话

# chat.openSettings
source: Open Settings
zh_hans: 打开设置

# chat.permission.openSettings
source: Open Settings
zh_hans: 打开设置

# chat.permission.run
source: Run `%@`?
zh_hans: 运行 `%@`？

# chat.permission.title
source: Permission Required
zh_hans: 需要权限

# chat.permission.write
source: Write %@?
zh_hans: 写入 %@？

# chat.permissionRequired
source: Permission Required
zh_hans: 需要权限

# chat.plan.sidebar.title
source: Agent Plan
zh_hans: 代理计划

# chat.plan.title
source: Plan:
zh_hans: 计划：

# chat.preview.unavailable
source: Preview not available
zh_hans: 预览不可用

# chat.recordVoiceMessage
source: Record voice message
zh_hans: 录制语音消息

# chat.resource.type
source: Type: %@
zh_hans: 类型：%@

# chat.selectModel
source: Select model
zh_hans: 选择模型

# chat.session.starting
source: Starting session...
zh_hans: 正在启动会话...

# chat.startConversation
source: Start a conversation with an AI agent
zh_hans: 与 AI 代理开始对话

# chat.startingSession
source: Starting session...
zh_hans: 正在启动会话...

# chat.status.cancelled
source: Cancelled
zh_hans: 已取消

# chat.status.completed
source: Completed
zh_hans: 已完成

# chat.status.inProgress
source: In Progress
zh_hans: 进行中

# chat.status.pending
source: Pending
zh_hans: 待处理

# chat.switch
source: Switch
zh_hans: 切换

# chat.switchAgent
source: Switch Agent?
zh_hans: 切换代理？

# chat.switchAgentWarning
source: Switching agents will clear the current conversation and start a new session. This cannot be undone.
zh_hans: 切换代理将清除当前对话并开始新会话。此操作无法撤销。

# chat.tool.details.title
source: Tool Execution Details
zh_hans: 工具执行详情

# chat.tool.status.done
source: done
zh_hans: 完成

# chat.tool.status.failed
source: failed
zh_hans: 失败

# chat.tool.status.pending
source: pending
zh_hans: 待处理

# chat.tool.status.running
source: running
zh_hans: 运行中

# chat.voice.record
source: Record voice message
zh_hans: 录制语音消息

source: command-name
zh_hans: 命令名称

# content.invalidImageData
source: Invalid image data
zh_hans: 无效的图像数据

# contentView.selectRepository
source: Select a Repository
zh_hans: 选择仓库

# contentView.selectRepositoryDescription
source: Choose a repository to view its worktrees
zh_hans: 选择一个仓库以查看其工作树

# contentView.selectWorktree
source: Select a Worktree
zh_hans: 选择工作树

# contentView.selectWorktreeDescription
source: Choose a worktree to view details and actions
zh_hans: 选择一个工作树以查看详情和操作

# error.git.commandFailed
source: Git command failed: %@
zh_hans: Git 命令失败：%@

# error.git.commandFailed %@
source: Git command failed: %@
zh_hans: Git 命令失败：%@

# error.git.invalidPath
source: Invalid repository path
zh_hans: 无效的仓库路径

# error.git.notRepository
source: Not a git repository
zh_hans: 不是 git 仓库

# error.git.timeout
source: Git command timed out
zh_hans: Git 命令超时

# error.git.unknownError
source: Unknown error
zh_hans: 未知错误

# error.git.worktreeNotFound
source: Worktree not found
zh_hans: 未找到工作树

# filter.all
source: Show All
zh_hans: 显示全部

# filter.clear
source: Clear Filters
zh_hans: 清除筛选

# filter.clearAll
source: Clear Filter
zh_hans: 清除筛选

# general.add
source: Add
zh_hans: 添加

# general.cancel
source: Cancel
zh_hans: 取消

# general.clone
source: Clone
zh_hans: 克隆

# general.create
source: Create
zh_hans: 创建

# general.loading
source: Loading...
zh_hans: 加载中...

# general.refresh
source: Refresh
zh_hans: 刷新

# general.retry
source: Retry
zh_hans: 重试

# general.save
source: Save
zh_hans: 保存

# git.branch.count %lld
source: %lld branches
zh_hans: %lld 个分支

# git.branch.create %@
source: Create branch: %@
zh_hans: 创建分支：%@

# git.branch.loadFailed %@
source: Failed to load branches: %@
zh_hans: 加载分支失败：%@

# git.branch.loadMore %lld
source: Load more (%lld remaining)
zh_hans: 加载更多（剩余 %lld）

# git.branch.loading
source: Loading branches...
zh_hans: 正在加载分支...

# git.branch.noBranches
source: No branches found
zh_hans: 未找到分支

# git.branch.noMatch %@
source: No branches match '%@'
zh_hans: 没有匹配 '%@' 的分支

# git.branch.search
source: Search branches
zh_hans: 搜索分支

# git.branch.searchOrCreate
source: Search or create new one
zh_hans: 搜索或创建新分支

# git.comment.add
source: Add Comment
zh_hans: 添加评论

# git.comment.edit
source: Edit Comment
zh_hans: 编辑评论

# git.commit.amend
source: Amend Last Commit
zh_hans: 修改上次提交

# git.commit.button
source: Commit
zh_hans: 提交

# git.commit.commitAll
source: Commit All
zh_hans: 全部提交

# git.commit.placeholder
source: Enter commit message
zh_hans: 输入提交消息

# git.commit.signoff
source: Commit with Sign-off
zh_hans: 带签名提交

# git.diff.cleanWorkingTree
source: Working tree is clean
zh_hans: 工作树是干净的

# git.diff.loading
source: Loading diff...
zh_hans: 正在加载差异...

# git.diff.noChanges
source: No changes
zh_hans: 无更改

# git.fileList.noChanges
source: No changes to commit
zh_hans: 没有要提交的更改

# git.history.empty
source: No commits yet
zh_hans: 暂无提交

# git.history.loadFailed
source: Failed to load history
zh_hans: 加载历史记录失败

# git.history.loadMore
source: Load more commits
zh_hans: 加载更多提交

# git.history.loading
source: Loading commits...
zh_hans: 正在加载提交...

# git.history.loadingMore
source: Loading more...
zh_hans: 正在加载更多...

# git.history.refresh
source: Refresh history
zh_hans: 刷新历史记录

# git.history.title
source: History
zh_hans: 历史记录

# git.history.viewUncommitted
source: View uncommitted changes
zh_hans: 查看未提交的更改

# git.history.workingChanges
source: Working Changes
zh_hans: 工作区更改

# git.panel.backToChanges
source: Back to Changes
zh_hans: 返回更改

# git.panel.comments
source: Comments
zh_hans: 评论

# git.panel.history
source: History
zh_hans: 历史记录

# git.panel.workflows
source: Workflows
zh_hans: 工作流

# git.sendToAgent.activeChats
source: Active Chats
zh_hans: 活动对话

# git.sendToAgent.chat
source: Chat
zh_hans: 对话

# git.sendToAgent.newChat %@
source: New %@ Chat
zh_hans: 新建 %@ 对话

# git.sendToAgent.send
source: Send
zh_hans: 发送

# git.sendToAgent.startNewChat
source: Start New Chat
zh_hans: 开始新对话

# git.sendToAgent.startNewConversation
source: Start a new conversation
zh_hans: 开始新对话

# git.sendToAgent.title
source: Send to Agent
zh_hans: 发送给代理

# git.sidebar.changes %lld
source: %lld Changes
zh_hans: %lld 个更改

# git.sidebar.changesSingular
source: 1 Change
zh_hans: 1 个更改

# git.sidebar.discard
source: Discard
zh_hans: 放弃

# git.sidebar.discardAll
source: Discard All Changes
zh_hans: 放弃所有更改

# git.sidebar.discardAllMessage
source: This will reset all staged and modified files to HEAD. This cannot be undone.
zh_hans: 这将把所有已暂存和已修改的文件重置为 HEAD。此操作无法撤销。

# git.sidebar.discardAllTitle
source: Discard All Changes?
zh_hans: 放弃所有更改？

# git.sidebar.noChanges
source: No Changes
zh_hans: 无更改

# git.sidebar.remove
source: Remove
zh_hans: 移除

# git.sidebar.removeUntracked
source: Remove Untracked Files
zh_hans: 移除未跟踪的文件

# git.sidebar.removeUntrackedMessage %lld
source: This will permanently delete %lld untracked file(s). This cannot be undone.
zh_hans: 这将永久删除 %lld 个未跟踪的文件。此操作无法撤销。

# git.sidebar.removeUntrackedTitle
source: Remove Untracked Files?
zh_hans: 移除未跟踪的文件？

# git.sidebar.stageAll
source: Stage All
zh_hans: 全部暂存

# git.sidebar.unstageAll
source: Unstage All
zh_hans: 全部取消暂存

# git.workflow.addFiles
source: Add workflow files to get started
zh_hans: 添加工作流文件以开始

# git.workflow.cancelRun
source: Cancel run
zh_hans: 取消运行

# git.workflow.checkingCLI
source: Checking CLI...
zh_hans: 正在检查 CLI...

# git.workflow.cliNotInstalled %@
source: %@ Not Installed
zh_hans: %@ 未安装

# git.workflow.disabled
source: Workflow is disabled
zh_hans: 工作流已禁用

# git.workflow.noProvider
source: No CI/CD Provider
zh_hans: 没有 CI/CD 提供商

# git.workflow.noRuns
source: No runs found
zh_hans: 未找到运行记录

# git.workflow.noWorkflows
source: No workflows found
zh_hans: 未找到工作流

# git.workflow.notAuthenticated
source: Not Authenticated
zh_hans: 未认证

# git.workflow.recentRuns
source: Recent Runs
zh_hans: 最近运行

# git.workflow.run
source: Run workflow
zh_hans: 运行工作流

# git.workflow.selectRun
source: Select a workflow run
zh_hans: 选择工作流运行

# git.workflow.selectRunHint
source: Choose a run from the list to view details, jobs, and logs.
zh_hans: 从列表中选择一个运行以查看详情、任务和日志。

# git.workflow.title
source: Workflows
zh_hans: 工作流

source: main
zh_hans: 主分支

# note.editor.markdownHint
source: Markdown supported
zh_hans: 支持 Markdown

# onboarding.feature.agents.description
source: Claude, Codex, Gemini, Kimi, and custom agents via Agent Client Protocol.
zh_hans: Claude、Codex、Gemini、Kimi 以及通过代理客户端协议的自定义代理。

# onboarding.feature.agents.title
source: Agents
zh_hans: 代理

# onboarding.feature.sessions.description
source: Each worktree has its own terminal, file browser, web browser, and chat.
zh_hans: 每个工作树都有自己的终端、文件浏览器、网页浏览器和对话。

# onboarding.feature.sessions.title
source: Per-Worktree Sessions
zh_hans: 每工作树会话

# onboarding.feature.setup.description
source: Add your first repository from the sidebar, configure agents in Settings, and start managing worktrees.
zh_hans: 从侧边栏添加您的第一个仓库，在设置中配置代理，然后开始管理工作树。

# onboarding.feature.setup.title
source: Quick Setup
zh_hans: 快速设置

# onboarding.feature.terminal.description
source: Built-in terminal with split pane support. Execute commands directly within your worktree context.
zh_hans: 内置终端，支持分割面板。直接在工作树上下文中执行命令。

# onboarding.feature.terminal.title
source: Integrated Terminal
zh_hans: 集成终端

# onboarding.feature.workspaces.description
source: Organize repositories into workspaces. Create worktrees to work on multiple branches in parallel.
zh_hans: 将仓库组织到工作区中。创建工作树以并行处理多个分支。

# onboarding.feature.workspaces.title
source: Workspaces & Worktrees
zh_hans: 工作区和工作树

# onboarding.feature.worktree.description
source: Manage multiple worktrees per repository. Switch between branches without losing work or stashing changes.
zh_hans: 管理每个仓库的多个工作树。在分支之间切换，无需丢失工作或暂存更改。

# onboarding.feature.worktree.title
source: Git Worktree Management
zh_hans: Git 工作树管理

# onboarding.getStarted
source: Get Started
zh_hans: 开始使用

# onboarding.joinDiscord
source: Join Discord Community
zh_hans: 加入 Discord 社区

# onboarding.subtitle
source: Your developer tool for Git worktrees with integrated terminal and AI agents
zh_hans: 您的 Git 工作树开发工具，集成终端和 AI 代理

# onboarding.tagline
source: Switch worktrees, not windows.
zh_hans: 切换工作树，而非窗口。

# onboarding.welcome
source: Welcome to Aizen
zh_hans: 欢迎使用 Aizen

# permission.action.allow
source: Allow
zh_hans: 允许

# permission.action.deny
source: Deny
zh_hans: 拒绝

# permission.action.view
source: View
zh_hans: 查看

# permission.banner.title %@
source: Permission requested in %@
zh_hans: 在 %@ 中请求权限

# permission.notification.body.default
source: Agent is requesting permission
zh_hans: 代理正在请求权限

# permission.notification.title %@
source: Permission Request - %@
zh_hans: 权限请求 - %@

# repository.add.choose
source: Choose...
zh_hans: 选择...

# repository.add.selected
source: Selected:
zh_hans: 已选择：

# repository.add.title
source: Add Repository
zh_hans: 添加仓库

# repository.add.url
source: Repository URL
zh_hans: 仓库 URL

# repository.cloneDescription
source: The repository will be cloned to the selected location
zh_hans: 仓库将被克隆到所选位置

# repository.cloneFromURL
source: Clone from URL
zh_hans: 从 URL 克隆

# repository.cloneLocation
source: Clone Location
zh_hans: 克隆位置

# repository.create.description
source: A new Git repository will be created in the selected folder
zh_hans: 将在所选文件夹中创建新的 Git 仓库

# repository.create.name
source: Repository Name
zh_hans: 仓库名称

# repository.createNew
source: Create New
zh_hans: 新建

# repository.editNote
source: Edit Note
zh_hans: 编辑备注

# repository.mode
source: Mode
zh_hans: 模式

# repository.newLocation
source: Parent Folder
zh_hans: 父文件夹

# repository.note.title %@
source: Note for %@
zh_hans: %@ 的备注

# repository.openExisting
source: Open Existing
zh_hans: 打开现有

# repository.panelSelectClone
source: Select where to clone the repository
zh_hans: 选择克隆仓库的位置

# repository.panelSelectCreateLocation
source: Select parent folder for new repository
zh_hans: 选择新仓库的父文件夹

# repository.panelSelectGit
source: Select a git repository folder
zh_hans: 选择 git 仓库文件夹

# repository.selectDestination
source: Select destination folder
zh_hans: 选择目标文件夹

# repository.selectFolder
source: Select repository folder
zh_hans: 选择仓库文件夹

# repository.selectGitFolder
source: Select a folder containing a git repository
zh_hans: 选择包含 git 仓库的文件夹

# repository.selectLocation
source: Repository Location
zh_hans: 仓库位置

# repository.setStatus
source: Set Status
zh_hans: 设置状态

# settings.advanced.reset.alert.cancel
source: Cancel
zh_hans: 取消

# settings.advanced.reset.alert.confirm
source: Reset
zh_hans: 重置

# settings.advanced.reset.alert.message
source: This will permanently delete all your data including workspaces, repositories, worktrees, and chat sessions. The app will quit after reset.
zh_hans: 这将永久删除所有数据，包括工作区、仓库、工作树和对话会话。重置后应用将退出。

# settings.advanced.reset.alert.title
source: Reset App?
zh_hans: 重置应用？

# settings.advanced.reset.button
source: Reset All Data
zh_hans: 重置所有数据

# settings.advanced.reset.description
source: This will delete all workspaces, repositories, worktrees, and chat sessions. This action cannot be undone.
zh_hans: 这将删除所有工作区、仓库、工作树和对话会话。此操作无法撤销。

# settings.advanced.reset.title
source: Reset App
zh_hans: 重置应用

# settings.advanced.title
source: Advanced
zh_hans: 高级

# settings.agents.defaultAgent
source: Default Agent:
zh_hans: 默认代理：

# settings.agents.executablePath
source: Executable Path
zh_hans: 可执行文件路径

# settings.agents.install
source: Install
zh_hans: 安装

# settings.agents.installing
source: Installing...
zh_hans: 正在安装...

# settings.agents.section
source: Agents
zh_hans: 代理

# settings.agents.testConnection
source: Test Connection
zh_hans: 测试连接

# settings.agents.testResult.error
source: Error
zh_hans: 错误

# settings.agents.testResult.failed
source: Failed
zh_hans: 失败

# settings.agents.testResult.invalid
source: Invalid
zh_hans: 无效

# settings.agents.testResult.success
source: Success
zh_hans: 成功

# settings.agents.title
source: Agents
zh_hans: 代理

# settings.editor.title
source: Editor
zh_hans: 编辑器

# settings.general.editor.command
source: Default Editor Command
zh_hans: 默认编辑器命令

# settings.general.editor.examples
source: Common editors: code (VS Code), cursor (Cursor), subl (Sublime), atom
zh_hans: 常用编辑器：code（VS Code）、cursor（Cursor）、subl（Sublime）、atom

# settings.general.editor.help
source: Command to launch your preferred code editor (e.g., 'code', 'cursor', 'subl')
zh_hans: 启动首选代码编辑器的命令（例如 'code'、'cursor'、'subl'）

# settings.general.editor.section
source: Editor
zh_hans: 编辑器

# settings.general.title
source: General
zh_hans: 通用

# settings.terminal.font.picker
source: Font
zh_hans: 字体

# settings.terminal.font.section
source: Font
zh_hans: 字体

# settings.terminal.font.size
source: Font Size: %lld
zh_hans: 字体大小：%lld

# settings.terminal.theme.picker
source: Theme
zh_hans: 主题

# settings.terminal.theme.section
source: Theme
zh_hans: 主题

# settings.terminal.title
source: Terminal
zh_hans: 终端

# sidebar.empty.filtered
source: No repositories match the current filter
zh_hans: 没有仓库匹配当前筛选

# sidebar.empty.noRepos
source: No repositories in this workspace
zh_hans: 此工作区中没有仓库

# sidebar.empty.search
source: No repositories match your search
zh_hans: 没有仓库匹配您的搜索

# sidebar.joinDiscord
source: Join Discord Community
zh_hans: 加入 Discord 社区

# sidebar.reportIssue
source: Report Issue
zh_hans: 报告问题

# sidebar.support
source: Get Help & Support
zh_hans: 获取帮助和支持

# sidebar.support.subtitle
source: Questions, feedback, or issues? Reach out anytime.
zh_hans: 有问题、反馈或问题？ 随时联系我们。

# sidebar.support.title
source: Get in Touch
zh_hans: 联系我们

# sidebar.supportAizen
source: Become Pro · Support Aizen
zh_hans: 成为专业版 · 支持 Aizen

# status.active
source: Active
zh_hans: 活跃

# status.archived
source: Archived
zh_hans: 已归档

# status.maintenance
source: Maintenance
zh_hans: 维护中

# status.paused
source: Paused
zh_hans: 已暂停

# terminal.close.cancel
source: Cancel
zh_hans: 取消

# terminal.close.confirm
source: Close
zh_hans: 关闭

# terminal.close.confirmMessage
source: A process is still running in this terminal. Are you sure you want to close it?
zh_hans: 此终端中仍有进程在运行。确定要关闭吗？

# terminal.close.confirmTitle
source: Close Terminal?
zh_hans: 关闭终端？

# terminal.new
source: New Terminal
zh_hans: 新建终端

# terminal.noSessions
source: No Terminal Sessions
zh_hans: 没有终端会话

# terminal.openInWorktree
source: Open a terminal in this worktree
zh_hans: 在此工作树中打开终端

source: tmux not installed. Install via: brew install tmux
zh_hans: tmux 未安装。请通过以下命令安装：brew install tmux

# toolCall.audio
source: Audio
zh_hans: 音频

# toolCall.copied
source: Copied
zh_hans: 已复制

# toolCall.copy
source: Copy
zh_hans: 复制

# toolCall.diff
source: Diff
zh_hans: 差异

# toolCall.diffContent
source: Diff content
zh_hans: 差异内容

# toolCall.embeddedResource
source: Embedded Resource
zh_hans: 嵌入资源

# toolCall.image
source: Image
zh_hans: 图像

# toolCall.resource
source: Resource
zh_hans: 资源

# toolCall.terminal
source: Terminal
zh_hans: 终端

# toolCall.textOutput
source: Text Output
zh_hans: 文本输出

# workspace.addRepository
source: Add Repository
zh_hans: 添加仓库

# workspace.create.color
source: Color (Optional)
zh_hans: 颜色（可选）

# workspace.create.create
source: Create
zh_hans: 创建
